# Найти максимальное из пяти чисел.

print(max(map(int, input("Введите 5 чисел через пробел: ").split())))
